XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
      RCC_AHB1PeriphClockCmd(USART7_Tx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART7_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(USART7_Rx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART7_Rx GPIO clock */
      
      GPIO_PinAFConfig(USART7_Tx_GPIO, USART7_Tx_GPIO_PinSource, GPIO_AF_UART7);  /* Connect GPIOxn to USART7_Tx */
      GPIO_PinAFConfig(USART7_Rx_GPIO, USART7_Rx_GPIO_PinSource, GPIO_AF_UART7);  /* Connect GPIOxn to USART7_Rx */
      
      GPIO_InitStructure.GPIO_Pin = USART7_Tx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(USART7_Tx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = USART7_Rx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(USART7_Rx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART7_BufferSize_Tx && USART7_DMA_BufferSize_Tx) || (USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART8)
  {
#if (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx)
#if USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART8_SendData_Flag = false;
    USART8_SendData_P    = NULL;
#endif /* USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx */
    
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART8_ReceiveData_P = NULL;
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
    
    if(USART8_RCC_Flag == false)
    {
      USART8_RCC_Flag = true;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART8, ENABLE); /* Enable USART8 clock */
    }
    
    if(USART8_GPIO_Flag == false)
    {
      USART8_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(USART8_Tx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART8_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(USART8_Rx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART8_Rx GPIO clock */
      
      GPIO_PinAFConfig(USART8_Tx_GPIO, USART8_Tx_GPIO_PinSource, GPIO_AF_UART8);  /* Connect GPIOxn to USART8_Tx */
      GPIO_PinAFConfig(USART8_Rx_GPIO, USART8_Rx_GPIO_PinSource, GPIO_AF_UART8);  /* Connect GPIOxn to USART8_Rx */
      
      GPIO_InitStructure.GPIO_Pin = USART8_Tx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(USART8_Tx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = USART8_Rx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(USART8_Rx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART8_BufferSize_Tx && USART8_DMA_BufferSize_Tx) || (USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx) */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if (USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx) || (USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx)
#if USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART9_SendData_Flag = false;
    USART9_SendData_P    = NULL;
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
    
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART9_ReceiveData_P = NULL;
#endif /* USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx */
    
    if(USART9_RCC_Flag == false)
    {
      USART9_RCC_Flag = true;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_UART9, ENABLE); /* Enable USART9 clock */
    }
    
    if(USART9_GPIO_Flag == false)
    {
      USART9_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(USART9_Tx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART9_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(USART9_Rx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART9_Rx GPIO clock */
      
      GPIO_PinAFConfig(USART9_Tx_GPIO, USART9_Tx_GPIO_PinSource, GPIO_AF11_UART9);  /* Connect GPIOxn to USART9_Tx */
      GPIO_PinAFConfig(USART9_Rx_GPIO, USART9_Rx_GPIO_PinSource, GPIO_AF11_UART9);  /* Connect GPIOxn to USART9_Rx */
      
      GPIO_InitStructure.GPIO_Pin = USART9_Tx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(USART9_Tx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = USART9_Rx_GPIO_Pin;   /* Specifies the GPIO pins to be configured. */
      GPIO_Init(USART9_Rx_GPIO, &GPIO_InitStructure);     /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx) || (USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx) */
  }
  else if(USARTx == UART10)
  {
#if (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx)
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    USART_Mode          |= USART_Mode_Tx;
    USART10_SendData_Flag = false;
    USART10_SendData_P    = NULL;
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
    
