XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
#if USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx
    USART_Mode          |= USART_Mode_Rx;
    USART10_ReceiveData_P = NULL;
#endif /* USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx */
    
    if(USART10_RCC_Flag == false)
    {
      USART10_RCC_Flag = true;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_UART10, ENABLE);  /* Enable USART10 clock */
    }
    
    if(USART10_GPIO_Flag == false)
    {
      USART10_GPIO_Flag = true;
      
      RCC_AHB1PeriphClockCmd(USART10_Tx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART10_Tx GPIO clock */
      RCC_AHB1PeriphClockCmd(USART10_Rx_RCC_AHB1Periph_GPIO, ENABLE);  /* Enable USART10_Rx GPIO clock */
      
      GPIO_PinAFConfig(USART10_Tx_GPIO, USART10_Tx_GPIO_PinSource, GPIO_AF11_UART10); /* Connect GPIOxn to USART10_Tx */
      GPIO_PinAFConfig(USART10_Rx_GPIO, USART10_Rx_GPIO_PinSource, GPIO_AF11_UART10); /* Connect GPIOxn to USART10_Rx */
      
      GPIO_InitStructure.GPIO_Pin = USART10_Tx_GPIO_Pin;  /* Specifies the GPIO pins to be configured. */
      GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;        /* Specifies the operating mode for the selected pins. */
      GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;  /* Specifies the speed for the selected pins. */
      GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;      /* Specifies the operating output type for the selected pins. */
      GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;        /* Specifies the operating Pull-up/Pull down for the selected pins. */
      GPIO_Init(USART10_Tx_GPIO, &GPIO_InitStructure);    /* Initializes the GPIOx peripheral. */
      
      GPIO_InitStructure.GPIO_Pin = USART10_Rx_GPIO_Pin;  /* Specifies the GPIO pins to be configured. */
      GPIO_Init(USART10_Rx_GPIO, &GPIO_InitStructure);    /* Initializes the GPIOx peripheral. */
    }
#else
    return;
#endif /* (USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx) || (USART10_BufferSize_Rx && USART10_DMA_BufferSize_Rx) */
  }
#endif /* STM32F413_423xx */
  
  USART_DeInit(USARTx);                                                           /* Deinitializes the USARTx peripheral registers to their default reset values. */
  USART_InitStructure.USART_BaudRate = BaudRate;                                  /* This member configures the USART communication baud rate. */
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;                     /* Specifies the number of data bits transmitted or received in a frame. */
  USART_InitStructure.USART_StopBits = USART_StopBits_1;                          /* Specifies the number of stop bits transmitted. */
  USART_InitStructure.USART_Parity = USART_Parity_No;                             /* Specifies the parity mode. */
  USART_InitStructure.USART_Mode = USART_Mode;                                    /* Specifies whether the Receive or Transmit mode is enabled or disabled. */
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; /* Specifies wether the hardware flow control mode is enabled or disabled. */
  USART_Init(USARTx, &USART_InitStructure);                                       /* Initializes the USARTx peripheral. */
  
  if(USART_Mode == USART_Mode_Tx)
  {
    USART_DMACmd(USARTx, USART_DMAReq_Tx, ENABLE);  /* Enabling the DMA request specified USARTx */
    USART_ITConfig(USARTx, USART_IT_TC, ENABLE);    /* Enabling interrupts specified USARTx */
    USART_DMA_TX_Configure(USARTx);                 /* Configuration USARTx DMA TX */
  }
  else if(USART_Mode == USART_Mode_Rx)
  {
    USART_DMACmd(USARTx, USART_DMAReq_Rx, ENABLE);  /* Enabling the DMA request specified USARTx */
    USART_ITConfig(USARTx, USART_IT_IDLE, ENABLE);  /* Enabling interrupts specified USARTx */
    USART_DMA_RX_Configure(USARTx);                 /* Configuration USARTx DMA RX */
  }
  else
  {
    USART_DMACmd(USARTx, USART_DMAReq_Tx, ENABLE);  /* Enabling the DMA request specified USARTx */
    USART_DMACmd(USARTx, USART_DMAReq_Rx, ENABLE);  /* Enabling the DMA request specified USARTx */
    USART_ITConfig(USARTx, USART_IT_TC, ENABLE);    /* Enabling interrupts specified USARTx */
    USART_ITConfig(USARTx, USART_IT_IDLE, ENABLE);  /* Enabling interrupts specified USARTx */
    USART_DMA_TX_Configure(USARTx);                 /* Configuration USARTx DMA TX */
    USART_DMA_RX_Configure(USARTx);                 /* Configuration USARTx DMA RX */
  }
  
  USART_Cmd(USARTx, ENABLE);                        /* Enables or disables the specified USARTx peripheral. */
  USART_NVIC_Configure(USARTx);                     /* Configuration USARTx NVIC */
}

/****************************************************************
 * Function:    USART_Unconfigure
 * Description: Unconfigure.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 * Output:
 * Return:
*****************************************************************/
void USART_Unconfigure(USART_TypeDef* USARTx)
{
  if(USARTx == USART1)
  {
#if (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx)
#if USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx
    USART1_SendData_Flag = false;
    USART1_SendData_P    = NULL;
#endif /* USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx */
    
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    USART1_ReceiveData_P = NULL;
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
    
    if(USART1_RCC_Flag == true)
    {
      USART1_RCC_Flag = false;
      
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, DISABLE); /* Disable USART1 clock */
      
      USART_DeInit(USART1); /* Deinitializes the USART1 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(USART1); /* Unconfigure USART1 DMA TX */
      USART_DMA_RX_Unconfigure(USART1); /* Unconfigure USART1 DMA RX */
      
      USART_NVIC_Unconfigure(USART1);   /* Unconfigure USART1 NVIC */
    }
#endif /* (USART1_BufferSize_Tx && USART1_DMA_BufferSize_Tx) || (USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx) */
  }
  else if(USARTx == USART2)
  {
#if (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx)
#if USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx
    USART2_SendData_Flag = false;
    USART2_SendData_P    = NULL;
#endif /* USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx */
    
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    USART2_ReceiveData_P = NULL;
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
    
    if(USART2_RCC_Flag == true)
    {
      USART2_RCC_Flag = false;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, DISABLE); /* Disable USART2 clock */
      
      USART_DeInit(USART2); /* Deinitializes the USART2 peripheral registers to their default reset values. */
      
      USART_DMA_TX_Unconfigure(USART2); /* Unconfigure USART2 DMA TX */
      USART_DMA_RX_Unconfigure(USART2); /* Unconfigure USART2 DMA RX */
      
      USART_NVIC_Unconfigure(USART2);   /* Unconfigure USART2 NVIC */
    }
#endif /* (USART2_BufferSize_Tx && USART2_DMA_BufferSize_Tx) || (USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx) */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if (USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx) || (USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx)
#if USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx
    USART3_SendData_Flag = false;
    USART3_SendData_P    = NULL;
#endif /* USART3_BufferSize_Tx && USART3_DMA_BufferSize_Tx */
    
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    USART3_ReceiveData_P = NULL;
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
    
    if(USART3_RCC_Flag == true)
    {
      USART3_RCC_Flag = false;
      
      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, DISABLE); /* Disable USART3 clock */
      
