XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    return Length;
#endif /* USART9_BufferSize_Tx && USART9_DMA_BufferSize_Tx */
  }
  else if(USARTx == UART10)
  {
#if USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx
    if((USART10_RCC_Flag == false) || (USART10_GPIO_Flag == false) || (USART10_DMA_Tx_Flag == false) || (USART10_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(Length > (USART10_BufferSize_Tx - USART10_SendData_P))
    {
      return NULL;
    }
    
    memcpy(USART10_Buffer_Tx + USART10_SendData_P, Data, Length); /* Copy memory */
    USART10_SendData_P += Length;
    
    if(USART10_SendData_Flag == false)
    {
      USART10_SendData_Flag = true;
      
      if(USART10_SendData_P > USART10_DMA_BufferSize_Tx)
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_DMA_BufferSize_Tx);                                               /* Copy memory */
        memmove(USART10_Buffer_Tx, USART10_Buffer_Tx + USART10_DMA_BufferSize_Tx, USART10_SendData_P - USART10_DMA_BufferSize_Tx); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);                      /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                                   /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);                 /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_DMA_BufferSize_Tx);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                                    /* Enables the specified DMA2 Stream7. */
        
        USART10_SendData_P -= USART10_DMA_BufferSize_Tx;
      }
      else
      {
        memcpy(USART10_DMA_Buffer_Tx, USART10_Buffer_Tx, USART10_SendData_P); /* Copy memory */
        
        DMA_ClearFlag(DMA2_Stream7, DMA_FLAG_TCIF7);               /* Clears the DMA2 Stream7's pending flags. */
        DMA_Cmd(DMA2_Stream7, DISABLE);                            /* Disables the specified DMA2 Stream7. */
        while(DMA_GetCmdStatus(DMA2_Stream7) != DISABLE);          /* Wait for the specified DMA2 Stream7 disable to finish. */
        DMA_SetCurrDataCounter(DMA2_Stream7, USART10_SendData_P);  /* Writes the number of data units to be transferred on the DMA2 Stream7. */
        DMA_Cmd(DMA2_Stream7, ENABLE);                             /* Enables the specified DMA2 Stream7. */
        
        USART10_SendData_P = NULL;
      }
    }
    
    return Length;
#endif /* USART10_BufferSize_Tx && USART10_DMA_BufferSize_Tx */
  }
#endif /* STM32F413_423xx */
  
  return NULL;
}

/****************************************************************
 * Function:    USART_GetReceiveData
 * Description: Get receive data.
 * Input:       USARTx: Where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9 or 10 to select the USART or UART peripheral.
 *              Data:   To store the address of the receive data.
 *              Length: To read the length of the received data.
 * Output:
 * Return:      To read the number of the received data.
*****************************************************************/
uint32_t USART_GetReceiveData(USART_TypeDef* USARTx, void* Data, uint32_t Length)
{
  uint32_t number = NULL;
  
  if((Data == NULL) || (Length == NULL))
  {
    return NULL;
  }
  
  if(USARTx == USART1)
  {
#if USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx
    if((USART1_RCC_Flag == false) || (USART1_GPIO_Flag == false) || (USART1_DMA_Rx_Flag == false) || (USART1_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART1_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART1_ReceiveData_P > Length)
    {
      memcpy(Data, USART1_Buffer_Rx, Length);                                               /* Copy memory */
      memmove(USART1_Buffer_Rx, USART1_Buffer_Rx + Length, USART1_ReceiveData_P - Length);  /* Copy memory */
      
      number = Length;
      USART1_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART1_Buffer_Rx, USART1_ReceiveData_P); /* Copy memory */
      
      number = USART1_ReceiveData_P;
      USART1_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART1_BufferSize_Rx && USART1_DMA_BufferSize_Rx */
  }
  else if(USARTx == USART2)
  {
#if USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx
    if((USART2_RCC_Flag == false) || (USART2_GPIO_Flag == false) || (USART2_DMA_Rx_Flag == false) || (USART2_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART2_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART2_ReceiveData_P > Length)
    {
      memcpy(Data, USART2_Buffer_Rx, Length);                                               /* Copy memory */
      memmove(USART2_Buffer_Rx, USART2_Buffer_Rx + Length, USART2_ReceiveData_P - Length);  /* Copy memory */
      
      number = Length;
      USART2_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART2_Buffer_Rx, USART2_ReceiveData_P); /* Copy memory */
      
      number = USART2_ReceiveData_P;
      USART2_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART2_BufferSize_Rx && USART2_DMA_BufferSize_Rx */
  }
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F412xG) || defined(STM32F413_423xx)
  else if(USARTx == USART3)
  {
#if USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx
    if((USART3_RCC_Flag == false) || (USART3_GPIO_Flag == false) || (USART3_DMA_Rx_Flag == false) || (USART3_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART3_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART3_ReceiveData_P > Length)
    {
      memcpy(Data, USART3_Buffer_Rx, Length);                                               /* Copy memory */
      memmove(USART3_Buffer_Rx, USART3_Buffer_Rx + Length, USART3_ReceiveData_P - Length);  /* Copy memory */
      
      number = Length;
      USART3_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART3_Buffer_Rx, USART3_ReceiveData_P); /* Copy memory */
      
      number = USART3_ReceiveData_P;
      USART3_ReceiveData_P = NULL;
    }
    
