XinLiGH/STM32F4xx_USART_Example/User/USART/USART.c
    return number;
#endif /* USART3_BufferSize_Rx && USART3_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F412xG || STM32F413_423xx */
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F446xx) || defined(STM32F413_423xx)
  else if(USARTx == UART4)
  {
#if USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx
    if((USART4_RCC_Flag == false) || (USART4_GPIO_Flag == false) || (USART4_DMA_Rx_Flag == false) || (USART4_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART4_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART4_ReceiveData_P > Length)
    {
      memcpy(Data, USART4_Buffer_Rx, Length);                                               /* Copy memory */
      memmove(USART4_Buffer_Rx, USART4_Buffer_Rx + Length, USART4_ReceiveData_P - Length);  /* Copy memory */
      
      number = Length;
      USART4_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART4_Buffer_Rx, USART4_ReceiveData_P); /* Copy memory */
      
      number = USART4_ReceiveData_P;
      USART4_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART4_BufferSize_Rx && USART4_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART5)
  {
#if USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx
    if((USART5_RCC_Flag == false) || (USART5_GPIO_Flag == false) || (USART5_DMA_Rx_Flag == false) || (USART5_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART5_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART5_ReceiveData_P > Length)
    {
      memcpy(Data, USART5_Buffer_Rx, Length);                                               /* Copy memory */
      memmove(USART5_Buffer_Rx, USART5_Buffer_Rx + Length, USART5_ReceiveData_P - Length);  /* Copy memory */
      
      number = Length;
      USART5_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART5_Buffer_Rx, USART5_ReceiveData_P); /* Copy memory */
      
      number = USART5_ReceiveData_P;
      USART5_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART5_BufferSize_Rx && USART5_DMA_BufferSize_Rx */
  }
#endif /* STM32F40_41xxx || STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F446xx || STM32F413_423xx */
  else if(USARTx == USART6)
  {
#if USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx
    if((USART6_RCC_Flag == false) || (USART6_GPIO_Flag == false) || (USART6_DMA_Rx_Flag == false) || (USART6_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART6_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART6_ReceiveData_P > Length)
    {
      memcpy(Data, USART6_Buffer_Rx, Length);                                               /* Copy memory */
      memmove(USART6_Buffer_Rx, USART6_Buffer_Rx + Length, USART6_ReceiveData_P - Length);  /* Copy memory */
      
      number = Length;
      USART6_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART6_Buffer_Rx, USART6_ReceiveData_P); /* Copy memory */
      
      number = USART6_ReceiveData_P;
      USART6_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART6_BufferSize_Rx && USART6_DMA_BufferSize_Rx */
  }
#if defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F469_479xx) || defined(STM32F413_423xx)
  else if(USARTx == UART7)
  {
#if USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx
    if((USART7_RCC_Flag == false) || (USART7_GPIO_Flag == false) || (USART7_DMA_Rx_Flag == false) || (USART7_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART7_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART7_ReceiveData_P > Length)
    {
      memcpy(Data, USART7_Buffer_Rx, Length);                                               /* Copy memory */
      memmove(USART7_Buffer_Rx, USART7_Buffer_Rx + Length, USART7_ReceiveData_P - Length);  /* Copy memory */
      
      number = Length;
      USART7_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART7_Buffer_Rx, USART7_ReceiveData_P); /* Copy memory */
      
      number = USART7_ReceiveData_P;
      USART7_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART7_BufferSize_Rx && USART7_DMA_BufferSize_Rx */
  }
  else if(USARTx == UART8)
  {
#if USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx
    if((USART8_RCC_Flag == false) || (USART8_GPIO_Flag == false) || (USART8_DMA_Rx_Flag == false) || (USART8_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART8_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART8_ReceiveData_P > Length)
    {
      memcpy(Data, USART8_Buffer_Rx, Length);                                               /* Copy memory */
      memmove(USART8_Buffer_Rx, USART8_Buffer_Rx + Length, USART8_ReceiveData_P - Length);  /* Copy memory */
      
      number = Length;
      USART8_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART8_Buffer_Rx, USART8_ReceiveData_P); /* Copy memory */
      
      number = USART8_ReceiveData_P;
      USART8_ReceiveData_P = NULL;
    }
    
    return number;
#endif /* USART8_BufferSize_Rx && USART8_DMA_BufferSize_Rx */
  }
#endif /* STM32F427_437xx || STM32F429_439xx || STM32F469_479xx || STM32F413_423xx */
#if defined(STM32F413_423xx)
  else if(USARTx == UART9)
  {
#if USART9_BufferSize_Rx && USART9_DMA_BufferSize_Rx
    if((USART9_RCC_Flag == false) || (USART9_GPIO_Flag == false) || (USART9_DMA_Rx_Flag == false) || (USART9_NVIC_Flag == false))
    {
      return NULL;
    }
    
    if(USART9_ReceiveData_P == NULL)
    {
      return NULL;
    }
    
    if(USART9_ReceiveData_P > Length)
    {
      memcpy(Data, USART9_Buffer_Rx, Length);                                               /* Copy memory */
      memmove(USART9_Buffer_Rx, USART9_Buffer_Rx + Length, USART9_ReceiveData_P - Length);  /* Copy memory */
      
      number = Length;
      USART9_ReceiveData_P -= Length;
    }
    else
    {
      memcpy(Data, USART9_Buffer_Rx, USART9_ReceiveData_P); /* Copy memory */
      
      number = USART9_ReceiveData_P;
      USART9_ReceiveData_P = NULL;
    }
    
